docs/posts/test-post.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-30 Fri 14:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>test post</title>
<meta name="author" content="Desktop-M" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
    <div>Lighthouse - Michael</div>
    <ul class="navbar">
        <li><a href="/">Home</a></li>
        <li><a href="/">Profile</a></li>
        <li><a href="/">About</a></li>
    </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">test post</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6d5f674">this is a test post</a></li>
</ul>
</div>
</div>
<div class="PREVIEW" id="org3530feb">
<p>
Nunc auctor commodo aliquam. Donec in laoreet mauris. Nam rhoncus pulvinar velit elementum condimentum. Donec convallis massa finibus odio consectetur dignissim. Donec ultricies nunc ultricies nunc vehicula, non pulvinar justo egestas. Mauris aliquet dapibus scelerisque. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Morbi 
</p>

</div>

<div id="outline-container-org6d5f674" class="outline-2">
<h2 id="org6d5f674">this is a test post</h2>
</div>
</div>
<div id="postamble" class="status">
<footer>
    footer area
</footer>
</div>
</body>
</html>
